<script setup>
import { reactive } from 'vue'
import { Collapse } from 'vue-collapsed'

const questions = reactive([
  {
    title: 'Что такое квесты в реальности?',
    answer: 'Квесты в реальности - развлечение необычного формата, набравшее популярность во всех городах России и за ее пределами. Это настоящая лихорадка - стоит только начать, и остановиться уже невозможно! <br><br> Принцип игры: следуя определенному сюжету, вас и вашу команду запирают в комнате, из которой вам нужно выбраться, решая все загадки и логические цепочки, подготовленные создателями. Решение всех головоломок квеста приведут вас к выходу.',
    isExpanded: false 
  },
  {
    title: 'Какие правила игры?',
    answer: 'Ваша задача - выбраться. А это значит, чтобы справиться с этой задачей, вам может понадобиться все, что находится внутри комнаты. Все что легко поддается, что можно взять в руки, прочитать или применить - все можно трогать. Исключение составляют не игровые элементы, которые, как правило, крепко накрепко стоят на своих местах, которые можно разве что оторвать.<br><br>Главное правило квеста: никакой грубой физической силы! Нельзя разрушать квест - все что приклеено, привязано, прикручено - таким и должно оставаться. Осматривайте все, ощупывайте, находите тайники, ключи, загадочные символы и вместе, всей командой, расшифровывайте их, а главное - получайте удовольствие!',
    isExpanded: false
  },
  {
    title: 'А если мы не справляемся, что делать?',
    answer: 'С обратной стороны камер (что установлены в квесте) за вами всегда наблюдает оператор. Именно он по любому вашему зову подскажет вам верное направление движения, как поступить в той или иной ситуации, и не укусит ли кто-нибудь в том темном углу.',
    isExpanded: false
  },
  {
    title: 'У вас страшные квесты?',
    answer: 'Нет, наши квесты абсолютно не страшные. Актеров в квестах не предусмотрено. Нами выбран жанр «эскейп-квесты» - который подразумевает собой большую проработку сюжета, загадок и атмосферы.<br><br> Но для любителей пощекотать нервишки два квеста из линейки «Чеширского» адаптированы под перформанс - «Джуманджи» и «Башня Франкенштейна». Стоимость заказа хоррор-версии квестов составляет +1500р к стоимости базовой игры. Заказ «хоррор-версии» должен быть не позднее чем за сутки до игры, по телефону с администратором колл-центра.',
    isExpanded: false
  },
  {
    title: 'Сколько длится квест?',
    answer: 'Обычный хронометраж квеста - 1 час. <br><br>На экшн-игры в темноте «Жмурки» предусмотрен 1 час: 3 раунда по 15 минут + по 5 минут перерыв между раундами.',
    isExpanded: false
  },
  {
    title: 'Нужно ли специально одеваться?',
    answer: 'Для похода в квест или в игры в темноте не нужно надевать каблуки, платья, пиджаки - более того, чем удобнее оденетесь, тем лучше! Ведь квесты в большинстве своем динамичные игры - где нужно быстро думать, быстро двигаться, и быстро решать загадки! А в платье это будет делать не очень удобно. <br><br>Наш совет: удобная повседневная одежда, обувь на удобной плоской подошве. <br><br>Для  Action kod спортивная одежда и сменная спортивная обувь обязательно! Если вы забыли сменную обувь, не переживайте, у нас есть аренда кроссовок с одноразовыми носочками.',
    isExpanded: false
  },
  {
    title: 'Сколько человек должно быть в команде?',
    answer: 'Квесты: От 2 до 4 игроков в команде, доплата за 5 и 6 игрока – 1000р.<br><br> Экшн-игры в темноте: от 2 до 26 человек. Action kod: от 2 до 18 человек. <br><br>В одной команде не более 6. <br><br>Обращаем ваше внимание, что рекомендованное количество человек в квесте – 4. Просим вас не превышать количество участников, так как степень участия в решении загадок может быть снижена.',
    isExpanded: false
  },
  {
    title: 'Как записаться на игру?',
    answer: 'Бронирование доступно на сайте chezakod.ru в разделе «Расписание», либо в карточке каждого квеста. <br><br>Либо по телефону +7(391) 986-76-90.',
    isExpanded: false
  },
  {
    title: 'Где вы находитесь?',
    answer: 'Квесты в Красноярске «Чеширский КОД» находятся по трем адресам: <br><br>Алексеева 113 (возле ТЦ «Оптима»): квесты «Станция Логос», «Операция «Петля Времени»<br><br> Робеспьера, 1 (возле Органного Зала): квесты «Башня Франкенштейна» и «Афера века»<br><br> Белинского, 8 (ТРК «КомсоМОЛЛ», 3 этаж): квесты  «Логово Великана», «Мумия: в поисках артефакта», «Джуманджи», «Корабль-призрак», «Семейка Аддамс», Экшн-игры в темноте для больших команд «Жмурки»<br><br> Мира, 91 (ТЦ City Hall): Action kod.',
    isExpanded: false
  },
  {
    title: 'Какие возрастные ограничения для игроков в квесте?',
    answer: 'Возраст участников - от 12 лет и до... верхняя планка не ограничена!<br><br> С 8 до 12 лет - только со взрослыми или аниматором.<br><br> Квесты «Чеширского Кода» рассчитаны на семейную аудиторию. Однако сюжеты квестов не страшные и легко адаптируются для детей при условии присутствия аниматора в игре. <br><br>Для игроков, возрастом от 8 до 12, желающим попасть в тайную мистерию без взрослых или родителей, предусмотрены опции «сопровождающий» или «аниматор в квесте», который поможет справиться со всеми загадками.<br><br> Услуга «сопровождающий» - специально обученный человек, который будет находиться внутри комнаты вместе с командой и будет помогать подсказками игрокам не уйти с линии сюжета и пройти весь квест.<strong> Стоимость: +1000р к стоимости игры.</strong><br><br> Услуга «аниматор в квесте» - костюмированный персонаж, который подстроится под историю и сюжет и поможет юным игрокам максимально погрузиться в историю.<strong> Стоимость: +1500р к стоимости игры.</strong> <br><br>Заказ услуг сопровождающий/аниматор в квесте должен быть не менее чем за сутки до начала игры.',
    isExpanded: false
  },
  {
    title: 'Я хочу отметить праздник, можно ли после квеста где-нибудь посидеть?',
    answer: 'После квеста у вас есть возможность разместиться в уютных зонах отдыха и отметить праздник. Приносите с собой угощения для гостей (напитки, пиццы, тортики, суши и т.д., за исключением алкогольных напитков). <br><br>Либо мы можем заказать для вас набор из 3х пицц компании ДОДО с нашей скидкой. <br><br>Размещение в зонах отдыха в течении 60 минут после игры стоит 2000 рублей.',
    isExpanded: false
  },
  {
    title: 'Могу ли я принести с собой угощения для гостей, или «со своим нельзя»?',
    answer: 'Запрета на «угощения с собой» нет, тортики-пиццы-суши также можно принести с собой для гостей. С нашей стороны мы предоставляем кружки, ложки, тарелки, безлимитный чай.<br><br> Стоимость данной услуги входит в стоимость банкетной комнаты - 2000 рублей/час. Индивидуальные условия для больших команд уточняются по телефону.',
    isExpanded: false
  },
  {
    title: 'Какие еще мероприятия можно проводить в квестах?',
    answer: 'При желании - любые, главное обсудить этот вопрос с администратором. <br><br>Фотосессии, тимбилдинги, корпоративы, дни рождения, и даже предложение руки и сердца - можно провести в стенах любой из локаций. Вам остается лишь позвонить нам, и мы поможем организовать самое запоминающееся мероприятие!',
    isExpanded: false
  }
])

function handleAccordion(selectedIndex) {
  questions.forEach((_, index) => {
    questions[index].isExpanded = index === selectedIndex ? !questions[index].isExpanded : false
  })
}

/**
 * For individual control you might use:
 *
 * function handleMultiple(index) {
 *   questions[index].isExpanded = !questions[index].isExpanded
 * }
 */
</script>

<template>
  <div class="accordion-container">
    <div class="accordion-column">
      <div class="accordion" v-for="(question, index) in questions.slice(0, Math.ceil(questions.length / 2))" :key="index">
        <button @click="handleAccordion(index)">
          {{ question.title }}
          <span class="arrow" :class="{ 'arrow-down': question.isExpanded }"></span>
        </button>
        <Collapse :when="question.isExpanded">
          <p v-html="question.answer"></p>
        </Collapse>
      </div>
    </div>
    <div class="accordion-column">
      <div class="accordion" v-for="(question, index) in questions.slice(Math.ceil(questions.length / 2))" :key="index + Math.ceil(questions.length / 2)">
        <button @click="handleAccordion(index + Math.ceil(questions.length / 2))">
          {{ question.title }}
          <span class="arrow" :class="{ 'arrow-down': question.isExpanded }"></span>
        </button>
        <Collapse :when="question.isExpanded">
          <p v-html="question.answer"></p>
        </Collapse>
      </div>
    </div>
  </div>
</template>

<style scoped>
.accordion-container {
  margin-top: 30px;
  display: flex;
  gap: 20px; /* Расстояние между колонками */
}

.accordion-column {
  flex: 1; /* Равномерное распределение пространства */
}

button {
  width: 100%;
  height: 60px;
  border: none;
  background-color: #CF1034;
  margin-bottom: 10px;
  font-size: 20px;
  text-align: left;
  border-radius: 5px;
  padding: 10px 25px;
  color: #fff;
  display: flex;
  justify-content: space-between;
  align-items: center;
  cursor: pointer;
}

p {
  font-size: 16px;
  color: #000;
  padding: 25px;
  border-radius: 5px;
  margin-top: -10px;
  text-align: justify;
  
}

.arrow {
  display: inline-block;
  width: 10px;
  height: 10px;
  border-right: 3px solid #fff;
  border-bottom: 3px solid #fff;
  transform: rotate(-45deg);
  transition: transform 0.3s ease;
}

.arrow-down {
  transform: rotate(45deg);
}
@media (max-width: 450px) {
  .accordion-container {
    flex-direction: column; /* Один столбец на мобильных устройствах */
    gap: 0px; /* Уменьшаем расстояние между элементами */
  }

  button {
    height: 50px; /* Уменьшаем высоту кнопки */
    font-size: 16px; /* Уменьшаем размер шрифта */
    padding: 10px 15px; /* Уменьшаем отступы */
  }

  p {
    font-size: 14px; /* Уменьшаем размер шрифта */
    padding: 15px; /* Уменьшаем отступы */
  }
}
</style>